# Clash Bot Workflow PR Details

## Lambda Function Versions used

| Lambda Function | Artifact Version |
| --------------- | ---------------- |
| Event Publisher | 187 |
| Event Handler | 191 |
| Event Notifier | 200 |
| Create Team | 187 |
| Retrieve Teams | 187 |
| Is Tournament Eligible | 188 |

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
module.event_publisher_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_publisher_exec_role-development]
module.create_team_step_function.data.aws_region.current[0]: Reading...
module.create_team_step_function.data.aws_caller_identity.current: Reading...
module.tournament_eligibility_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=tournament_eligibility_exec_role-development]
aws_apigatewayv2_api.clash_bot_websocket_api: Refreshing state... [id=k10wm04op6]
aws_cloudwatch_log_group.api_gateway_default_log_group: Refreshing state... [id=api_gateway_default_log_group-development]
module.retrieve_team_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=retrieve_team_exec_role-development]
module.create_team_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=create_team_exec_role-development]
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.event_notifier_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_notifier_exec_role-development]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=r0loqlg3t3]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
data.aws_acm_certificate.issued: Reading...
module.events_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-events-development]
module.event_handler_lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=event_handler_exec_role-development]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
aws_apigatewayv2_stage.clash_bot_websocket_api_stage: Refreshing state... [id=events-development]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.event_publisher_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-publisher-Policy-development]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=create-team-development]
module.event_publisher_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-publisher-development]
module.event_notifier_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-notifier-Policy-development]
module.event_notifier_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-notifier-development]
module.event_publisher_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_publisher_exec_role-development-20231118000957978600000002]
module.retrieve_team_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-team-Policy-development]
module.tournament_eligibility_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/tournament-eligibility-Policy-development]
module.create_team_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-team-development]
module.retrieve_team_lambda.aws_lambda_function.lambda: Refreshing state... [id=retrieve-team-development]
module.tournament_eligibility_lambda.aws_lambda_function.lambda: Refreshing state... [id=tournament-eligibility-development]
data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.create_team_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-Policy-development]
module.event_notifier_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_notifier_exec_role-development-20231119090315299300000001]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
module.retrieve_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=retrieve_team_exec_role-development-20231118000958206700000003]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway-development]
module.tournament_eligibility_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=tournament_eligibility_exec_role-development-20231118000958741200000004]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2/teams"]: Refreshing state... [id=zlvcq9c]
aws_lambda_permission.clash_bot_ws_lambda_permission: Refreshing state... [id=terraform-20231119090321485100000002]
aws_apigatewayv2_integration.clash_bot_websocket_api_integration: Refreshing state... [id=dczcm2o]
module.create_team_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=create_team_exec_role-development-20231118000957795600000001]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["lambda"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development]
module.create_team_step_function.data.aws_iam_policy_document.service["lambda"]: Read complete after 0s [id=2997044669]
module.create_team_step_function.aws_iam_policy.service["lambda"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-lambda]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/create-team-development-dynamodb]
aws_apigatewayv2_route.clash_bot_connection_route: Refreshing state... [id=w7fedob]
aws_apigatewayv2_route.clash_bot_disconnection_route: Refreshing state... [id=mofj5ku]
aws_apigatewayv2_route.clash_bot_default_route: Refreshing state... [id=abcbmf8]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2/teams"]: Refreshing state... [id=i2to2qo]
module.create_team_step_function.aws_iam_policy_attachment.service["lambda"]: Refreshing state... [id=create-team-development-lambda]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=create-team-development-dynamodb]
aws_lambda_permission.create_team_permission: Refreshing state... [id=CreateTeamPermission-development]
module.event_handler_lambda.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/event-handler-Policy-development]
aws_lambda_permission.tournament_eligibility_permission: Refreshing state... [id=TournamentEligibilityPermission-development]
module.event_handler_lambda.aws_lambda_function.lambda: Refreshing state... [id=event-handler-development]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=gt4pmg]
aws_apigatewayv2_deployment.clash_bot_websocket_api_deployment: Refreshing state... [id=j94cin]
module.event_handler_lambda.aws_iam_role_policy_attachment.lambda_exec_policy: Refreshing state... [id=event_handler_exec_role-development-20231118001013189900000005]
aws_lambda_event_source_mapping.event_handler_sqs_trigger: Refreshing state... [id=7fd6c898-c397-49fa-b143-76747922a919]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.event_notifier_lambda.aws_iam_policy.policy will be updated in-place
  ~ resource "aws_iam_policy" "policy" {
        id          = "arn:aws:iam::816923827429:policy/event-notifier-Policy-development"
        name        = "event-notifier-Policy-development"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-events-development"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.event_notifier_lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "event-notifier-development"
      ~ last_modified                  = "2023-11-19T09:03:21.588+0000" -> (known after apply)
      ~ s3_key                         = "artifacts/event-notifier/development/artifact-192.zip" -> "artifacts/event-notifier/development/artifact-200.zip"
        tags                           = {}
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "TABLE_NAME" = "clash-bot-events-development"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.events_table.aws_dynamodb_table.this[0] must be replaced
-/+ resource "aws_dynamodb_table" "this" {
      ~ arn                         = "arn:aws:dynamodb:us-east-1:816923827429:table/clash-bot-events-development" -> (known after apply)
      - deletion_protection_enabled = false -> null
      ~ hash_key                    = "connectionId" -> "topic" # forces replacement
      ~ id                          = "clash-bot-events-development" -> (known after apply)
      ~ name                        = "clash-bot-events-development" -> "clash-bot-topics-development" # forces replacement
      - range_key                   = "context" -> null # forces replacement
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      - table_class                 = "STANDARD" -> null
      ~ tags                        = {
          ~ "Name" = "clash-bot-events-development" -> "clash-bot-topics-development"
        }
      ~ tags_all                    = {
          ~ "Name"        = "clash-bot-events-development" -> "clash-bot-topics-development"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - attribute {
          - name = "connectionId" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "context" -> null
          - type = "S" -> null
        }
      + attribute {
          + name = "topic"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.subscriber_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "subscriber"
      + id               = (known after apply)
      + name             = "clash-bot-subscriber-development"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "clash-bot-subscriber-development"
        }
      + tags_all         = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
          + "Name"        = "clash-bot-subscriber-development"
        }
      + write_capacity   = 5

      + attribute {
          + name = "subscriber"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

Plan: 2 to add, 2 to change, 1 to destroy.
module.events_table.aws_dynamodb_table.this[0]: Destroying... [id=clash-bot-events-development]
module.subscriber_table.aws_dynamodb_table.this[0]: Creating...
module.events_table.aws_dynamodb_table.this[0]: Destruction complete after 2s
module.events_table.aws_dynamodb_table.this[0]: Creating...
module.events_table.aws_dynamodb_table.this[0]: Creation complete after 6s [id=clash-bot-topics-development]
module.subscriber_table.aws_dynamodb_table.this[0]: Still creating... [10s elapsed]
module.subscriber_table.aws_dynamodb_table.this[0]: Creation complete after 13s [id=clash-bot-subscriber-development]
module.event_notifier_lambda.aws_iam_policy.policy: Modifying... [id=arn:aws:iam::816923827429:policy/event-notifier-Policy-development]
module.event_notifier_lambda.aws_lambda_function.lambda: Modifying... [id=event-notifier-development]
module.event_notifier_lambda.aws_iam_policy.policy: Modifications complete after 0s [id=arn:aws:iam::816923827429:policy/event-notifier-Policy-development]
module.event_notifier_lambda.aws_lambda_function.lambda: Still modifying... [id=event-notifier-development, 10s elapsed]
module.event_notifier_lambda.aws_lambda_function.lambda: Modifications complete after 12s [id=event-notifier-development]

Apply complete! Resources: 2 added, 2 changed, 1 destroyed.

Outputs:

api-gateway-endpoint = "https://r0loqlg3t3.execute-api.us-east-1.amazonaws.com"
create-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:create-team-development"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-handler-development"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:event-publisher-development"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
retrieve-team-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:retrieve-team-development"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:create-team-development"
tournament-eligibility-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:tournament-eligibility-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*